IDEA Open Model
StructuralPlateType Enumeration
Compatible with IDEA StatiCa v 10.1
 Tyoe of structural plate
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public enum StructuralPlateType
Public Enumeration StructuralPlateType
public enum class StructuralPlateType
Members
Member name | Value | Description
SteelPlate | 0 |  Steel plate
Weld | 1 |  Weld
See Also
Reference
IdeaRS.OpenModel.Result Namespace